Revit 2024 API
FabricationConfiguration.GetMaterialGaugeByGUID Method
 Gets the material gauge identifier by its GUID and material identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int GetMaterialGaugeByGUID(
	Guid gaugeGUID,
	int materialId
)
Visual Basic
Public Function GetMaterialGaugeByGUID ( _
	gaugeGUID As Guid, _
	materialId As Integer _
) As Integer
Visual C++
public:
int GetMaterialGaugeByGUID(
	Guid gaugeGUID,
	int materialId
)
Parameters
gaugeGUID
Type: System.Guid
 The material gauge GUID.
materialId
Type: System.Int32
 The material identifier. The same material gauge GUID could have different material gauge identifiers for different materials.
Return Value
 The gauge identifier. Returns 0 if not found.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace